# В водоёме обитают рыбы. Чтобы определить, сколько там всего рыб, мы выловили,
# пометили часть из них и отпустили обратно. Через некоторое время мы начали
# вылавливать рыб и считать сколько меченых нам попалось. 941 меченая рыба 
# попалась нам один раз, а 109 рыб попались нам дважды. Итого 1050 меченных рыб. 
# Предполагается, что распределение вылова меченых рыб подчиняется распределению 
# Пуассона. Исходя из этого определите параметр распределения и в ответе укажите, 
# сколько всего рыб в водоёме.
# lambda	vector of (non-negative) means.
o <- 941
d <- 109
