# Предположим, что мы бросили другую монетку 4 раза и повторили это 25 раз.
# Получили такое распределение 3,0,3,3,1,2,3,3,3,1,2,3,2,1,1,2,3,2,1,2,2,3,2,3,4 
# Определите параметры распределения. В ответе укажите вероятность того, 
# что орёл выпадет больше 2 раз.

result <- c(3,0,3,3,1,2,3,3,3,1,2,3,2,1,1,2,3,2,1,2,2,3,2,3,4)
sorted_result <- sort(result)
mean_result <- sum(result)/25
var_result <- sum((result - mean_result)**2 / 24)
p2 <- 8/25

k3 = 3
n = 4
C3 <- factorial(n) / (factorial(k3) * factorial(n-k3))
p3 <- C3 * p2^k3 * (1-p2)^(n-k3)

k4 = 4
C4 <- factorial(n) / (factorial(k4) * factorial(n-k4))
p4 <- C4 * p2^k4 * (1-p2)^(n-k4)

print(p3+p4)
