# Предположим, что мы бросили другую монетку 4 раза и повторили это 25 раз.
# Получили такое распределение 3,0,3,3,1,2,3,3,3,1,2,3,2,1,1,2,3,2,1,2,2,3,2,3,4 
# Определите параметры распределения. В ответе укажите вероятность того, 
# что орёл выпадет больше 2 раз.

result <- c(3,0,3,3,1,2,3,3,3,1,2,3,2,1,1,2,3,2,1,2,2,3,2,3,4)
sorted_result <- sort(result)
mean_result <- sum(result)/25
var_result <- sum((result - mean_result)**2 / 24)
p2 <- 8/25

# P(X = k) = C(n,k) * p^k * (1-p)^n-k
# C(n,k) = n! / (k! * (n-k)!) 
n = 4
k = 2
c <- factorial(n) / (factorial(k) * factorial(n-k))
# 0.32 = 6 * p^k * (1-p)^(n-k)
# 0.32 = 6 * p^2 * (1-p)^(2)
# 0.32 = 6 * p^2 * (1-p)*(1-p)
# 0.32 = 6p^2 * (1 - 2p + p^2)
# 0.32 = 6p^2 - 12p^3 + 6p^4
# 0 = 6p^4 - 12p^3 + 6p^2 - 0.32
z <- c(-0.32, 0, 6, -12, 6)
prob <- polyroot(z)
p <- 0.638
rez = 0
for (i in 3:4){
  C <- factorial(n) / (factorial(i) * factorial(n-i))
  pi <- C * p^i * (1-p)^(n-i)
  rez = rez + pi
}
print(rez)
